vocales = {'a': 'ア', 'i': 'イ', 'u': 'ウ', 'e': 'エ', 'o': 'オ'}

basico = {
                   'ka':'カ','ki':'キ','ku':'ク','ke':'ケ','ko':'コ',
                   'sa':'サ','shi':'シ','su':'ス','se':'セ','so':'ソ',
                   'ta':'タ','chi':'チ','tsu':'ツ','te':'テ','to':'ト',
                   'na':'ナ','ni':'ニ','nu':'ヌ','ne':'ネ','no':'ノ',
                   'ha':'ハ','hi':'ヒ','fu':'フ','he':'ヘ','ho':'ホ',
                   'ma':'マ','mi':'ミ','mu':'ム','me':'メ','mo':'モ',
                   'ya':'ヤ','yu':'ユ','yo':'ヨ',
                   'ra':'ラ','ri':'リ','ru':'ル','re':'レ','ro':'ロ',
                   'wa':'ワ','wo':'ヲ ','n':'ン'
}

compuesto = {
                      'ga':'ガ','gi':'ギ','gu':'グ','ge':'ゲ','go':'ゴ',
                      'za':'ザ','ji':'ジ','zu':'ズ','ze':'ゼ','zo':'ゾ',
                      'da':'ダ','dji':'ヂ','dzu':'ヅ','de':'デ','do':'ド',
                      'ba':'バ','bi':'ビ','bu':'ブ','be':'ベ','bo':'ボ',
                      'pa':'パ','pi':'ピ','pu':'プ','pe':'ペ','po':'ポ'
}

combinado_1 = {
                        'kya':'キャ','kyu':'キュ','kyo':'キョ',
                        'sha':'シャ','shu':'シュ','sho':'ショ',
                        'cha':'チャ','chu':'チュ','cho':'チョ',
                        'nya':'ニャ','nyu':'ニュ','nyo':'ニョ',
                        'hya':'ひゃ','hyu':'ひゅ','hyo':'ひょ',
                        'mya':'みゃ','myu':'みゅ','myo':'みょ'
}

combinado_2 = {
                        'rya': 'りゃ', 'ryu': 'りゅ', 'ryo': 'りょ',
                        'gya':'ギャ','gyu':'ギュ','gyo':'ギョ',
                        'ja':'ジャ','ju':'ジュ','jo':'ジョ',
                        'bya':'ビャ','byu':'ビュ','byo':'ビョ',
                        'pya':'ピャ','pyu':'ピュ','pyo':'ピョ'
}
